; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v3 - type_1 ?v2 - type_3)
 	      (pred_1 ?v7 - object ?v2 - type_3)
	      (pred_3 ?v3 - type_1 ?v8 - type_2)
	      (pred_4 ?v3 - type_1 ?v7 - object ?v8 - type_2))

   (:action op_1
       :parameters  (?v3 - type_1 ?v6 ?v5 - type_3)
       :precondition (and  (pred_2 ?v3 ?v6))
       :effect (and  (pred_2 ?v3 ?v5)
		     (not (pred_2 ?v3 ?v6))))

   (:action op_2
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v1) (pred_2 ?v3 ?v1) (pred_3 ?v3 ?v8))
       :effect (and (pred_4 ?v3 ?v4 ?v8)
		    (not (pred_1 ?v4 ?v1)) 
		    (not (pred_3 ?v3 ?v8))))

   (:action op_3
       :parameters (?v3 - type_1 ?v4 - object ?v1 - type_3 ?v8 - type_2)
       :precondition  (and  (pred_4 ?v3 ?v4 ?v8) (pred_2 ?v3 ?v1))
       :effect (and (pred_1 ?v4 ?v1)
		    (pred_3 ?v3 ?v8)
		    (not (pred_4 ?v3 ?v4 ?v8)))))

; problem
(define (problem gripper-2-3-2)
(:domain gripper-strips)
(:objects obj_07 obj_08 - type_1
obj_09 obj_03 obj_11 obj_10 - type_2
obj_06 obj_04 obj_05 - type_3
obj_01 obj_02 - object)
(:init
(pred_2 obj_07 obj_05)
(pred_3 obj_07 obj_09)
(pred_3 obj_07 obj_03)
(pred_2 obj_08 obj_05)
(pred_3 obj_08 obj_11)
(pred_3 obj_08 obj_10)
(pred_1 obj_01 obj_04)
(pred_1 obj_02 obj_04)
)
(:goal
(and
(pred_1 obj_01 obj_04)
(pred_1 obj_02 obj_06)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_04)))
)
)

; plan
1. (op_1 obj_07 obj_05 obj_06)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_06)
   goals met: 1 of 2
2. (op_1 obj_08 obj_05 obj_04)
   deleted: (pred_2 obj_08 obj_05)
   added: (pred_2 obj_08 obj_04)
   goals met: 1 of 2
3. (op_2 obj_08 obj_02 obj_04 obj_10)
   deleted: (pred_1 obj_02 obj_04) (pred_3 obj_08 obj_10)
   added: (pred_4 obj_08 obj_02 obj_10)
   goals met: 1 of 2
4. (op_1 obj_08 obj_04 obj_06)
   deleted: (pred_2 obj_08 obj_04)
   added: (pred_2 obj_08 obj_06)
   goals met: 1 of 2
5. (op_3 obj_08 obj_02 obj_06 obj_10)
   deleted: (pred_4 obj_08 obj_02 obj_10)
   added: (pred_1 obj_02 obj_06) (pred_3 obj_08 obj_10)
   goals met: 2 of 2
